In [2]:
import pandas as pd

## Membaca file AgeDataset.csv

In [22]:
data = pd.read_csv('AgeDataset.csv', index_col=0)
data.head()

                      Name  Age
0        George Washington   67
1            Douglas Adams   49
2          Abraham Lincoln   56
3  Wolfgang Amadeus Mozart   35
4     Ludwig van Beethoven   57

## Apply filter pada DataFrame dengan menggunakan fungsi .apply(). Dimana fungsi ini menerima sebuah fungsi dengan satu argument dan nanti fungsi ini akan digunakan pada axis 1.

In [26]:
data = data[data.apply(lambda x: 's' in x['Name'], axis=1)]
data.head()

                         Name  Age
0           George Washington   67
1               Douglas Adams   49
3     Wolfgang Amadeus Mozart   35
5   Jean-François Champollion   42
10              Elvis Presley   42